### 1 To clean insurance data

In [1]:
pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2017.2 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (2025.2)
Requirement already satisfied: numpy>=1.15.4 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from pandas) (1.21.6)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [140]:
sales_data_2017=pd.read_csv('sales_transaction_2017.csv')
sales_data_2028=pd.read_csv('sales_transaction_2018.csv')
sales_data_2019=pd.read_csv('sales_transaction_2019.csv')
sales_data=pd.concat([sales_data_2017,sales_data_2028,sales_data_2019])
sales_data_edited=pd.read_csv('Sales_transaction_edited.csv')

In [110]:
sales_data

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,1/4/2017,1,SOLANKI PLASTICS,DONA-VAI-9100,2,1690,NaN,NaN,NaN
1,1/4/2017,1,SOLANKI PLASTICS,LITE FOAM(1200),6,1620,NaN,NaN,NaN
2,1/4/2017,2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500,23,NaN,NaN,NaN
3,1/4/2017,2,SARNESWARA TRADERS,LITE FOAM(1200),6,1620,NaN,NaN,NaN
4,1/4/2017,2,SARNESWARA TRADERS,DONA-VAI-9100,5,1690,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19171,10/10/2019,Sal:4935,K.SRIHARI,13*16 WHITE RK,400,16,"6,400.00",NaN,NaN
19172,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19173,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19174,NaN,Total,NaN,NaN,"99,284.90","175,381.65","2,203,649.50","20,680.00","2,189,014.50"
19175,NaN,Total,NaN,NaN,"2,710,193.00","5,519,888.40","53,360,791.40","672,984.00","52,830,224.40"

In [111]:
sales_data.dtypes

Date              object
Voucher           object
Party             object
Product           object
Qty               object
Rate              object
Gross             object
Disc              object
Voucher Amount    object
dtype: object

In [112]:
sales_data.shape

(159478, 9)

In [113]:
sales_data.isnull().sum()

Date                7203
Voucher             7182
Party                 25
Product             7203
Qty                 7182
Rate                7183
Gross             102744
Disc              156739
Voucher Amount    143266
dtype: int64

In [114]:
sales_data.describe()

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
count,152275,152296,159453,152275,152296,152295.0,56734,2739,16212
unique,1138,19640,1615,962,808,1905.0,2056,268,5214
top,,,TP13,14 GREEN,100,26.0,,,
freq,1708,1708,20449,3626,12529,2733.0,1708,1708,1708

In [115]:
sales_data.Date

0          1/4/2017
1          1/4/2017
2          1/4/2017
3          1/4/2017
4          1/4/2017
            ...
19171    10/10/2019
19172           NaN
19173           NaN
19174           NaN
19175           NaN
Name: Date, Length: 159478, dtype: object

### To convert object into datetime

In [141]:
pd.to_datetime(sales_data['Date'],errors="coerce",format="%d/%m/%Y")

0       2017-04-01
1       2017-04-01
2       2017-04-01
3       2017-04-01
4       2017-04-01
           ...
19171   2019-10-10
19172          NaT
19173          NaT
19174          NaT
19175          NaT
Name: Date, Length: 159478, dtype: datetime64[ns]

In [142]:
sales_data["Date"]=pd.to_datetime(sales_data["Date"],errors="coerce",format="%d/%m/%Y")

In [118]:
sales_data

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,2017-04-01,1,SOLANKI PLASTICS,DONA-VAI-9100,2,1690,NaN,NaN,NaN
1,2017-04-01,1,SOLANKI PLASTICS,LITE FOAM(1200),6,1620,NaN,NaN,NaN
2,2017-04-01,2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500,23,NaN,NaN,NaN
3,2017-04-01,2,SARNESWARA TRADERS,LITE FOAM(1200),6,1620,NaN,NaN,NaN
4,2017-04-01,2,SARNESWARA TRADERS,DONA-VAI-9100,5,1690,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19171,2019-10-10,Sal:4935,K.SRIHARI,13*16 WHITE RK,400,16,"6,400.00",NaN,NaN
19172,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19173,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19174,NaT,Total,NaN,NaN,"99,284.90","175,381.65","2,203,649.50","20,680.00","2,189,014.50"
19175,NaT,Total,NaN,NaN,"2,710,193.00","5,519,888.40","53,360,791.40","672,984.00","52,830,224.40"

###  To drop rows if Product is empty

In [143]:
sales_data.dropna(axis=0,subset=["Product"])

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,2017-04-01,1,SOLANKI PLASTICS,DONA-VAI-9100,2,1690,NaN,NaN,NaN
1,2017-04-01,1,SOLANKI PLASTICS,LITE FOAM(1200),6,1620,NaN,NaN,NaN
2,2017-04-01,2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500,23,NaN,NaN,NaN
3,2017-04-01,2,SARNESWARA TRADERS,LITE FOAM(1200),6,1620,NaN,NaN,NaN
4,2017-04-01,2,SARNESWARA TRADERS,DONA-VAI-9100,5,1690,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19167,2019-10-10,Sal:4935,K.SRIHARI,16*20(100-W),140,26,"3,640.00",NaN,NaN
19168,2019-10-10,Sal:4935,K.SRIHARI,10*12 KRISHNA-BK(10,600,8.4,"5,040.00",NaN,NaN
19169,2019-10-10,Sal:4935,K.SRIHARI,13*16 Bk(100)KRISHN,320,16,"5,120.00",NaN,NaN
19170,2019-10-10,Sal:4935,K.SRIHARI,10*12 RK,800,8.5,"6,800.00",NaN,NaN
19171,2019-10-10,Sal:4935,K.SRIHARI,13*16 WHITE RK,400,16,"6,400.00",NaN,NaN

### To drop rows if both quantity and rate is empty

In [144]:
sales_data.dropna(subset=["Qty","Rate"],inplace=True)

In [145]:
sales_data[sales_data['Gross'].isna()]

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,2017-04-01,1,SOLANKI PLASTICS,DONA-VAI-9100,2,1690,NaN,NaN,NaN
1,2017-04-01,1,SOLANKI PLASTICS,LITE FOAM(1200),6,1620,NaN,NaN,NaN
2,2017-04-01,2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500,23,NaN,NaN,NaN
3,2017-04-01,2,SARNESWARA TRADERS,LITE FOAM(1200),6,1620,NaN,NaN,NaN
4,2017-04-01,2,SARNESWARA TRADERS,DONA-VAI-9100,5,1690,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
95557,2019-09-12,4265,TP13,SPOON MED M.W,20,11,NaN,NaN,NaN
95558,2019-09-12,4266,K.SRIHARI,SMART BOUL(48),1,1830,NaN,NaN,NaN
95559,2019-09-12,4267,SMS,SMARTBOUL GLA(4000),1,1520,NaN,NaN,NaN
95560,2019-09-12,4268,ANILFANCY,RR WINEGLASS,100,20,NaN,NaN,NaN
95561,2019-09-12,4268,ANILFANCY,RR WATER GLASS,100,20,NaN,NaN,NaN

### To fill missing gross value basd on available quntity and rate

In [146]:
sales_data['Qty']=pd.to_numeric(sales_data['Qty'].astype(str).str.replace(",","",regex=False),errors="ignore")

In [147]:
sales_data.dtypes

Date              datetime64[ns]
Voucher                   object
Party                     object
Product                   object
Qty                       object
Rate                      object
Gross                     object
Disc                      object
Voucher Amount            object
dtype: object

In [148]:
sales_data=sales_data[sales_data['Qty']!=" "]

In [156]:
sales_data

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,2017-04-01,1,SOLANKI PLASTICS,DONA-VAI-9100,2.0,1690,NaN,NaN,NaN
1,2017-04-01,1,SOLANKI PLASTICS,LITE FOAM(1200),6.0,1620,NaN,NaN,NaN
2,2017-04-01,2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500.0,23,NaN,NaN,NaN
3,2017-04-01,2,SARNESWARA TRADERS,LITE FOAM(1200),6.0,1620,NaN,NaN,NaN
4,2017-04-01,2,SARNESWARA TRADERS,DONA-VAI-9100,5.0,1690,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19169,2019-10-10,Sal:4935,K.SRIHARI,13*16 Bk(100)KRISHN,320.0,16,"5,120.00",NaN,NaN
19170,2019-10-10,Sal:4935,K.SRIHARI,10*12 RK,800.0,8.5,"6,800.00",NaN,NaN
19171,2019-10-10,Sal:4935,K.SRIHARI,13*16 WHITE RK,400.0,16,"6,400.00",NaN,NaN
19174,NaT,Total,NaN,NaN,99284.9,"175,381.65","2,203,649.50","20,680.00","2,189,014.50"
19175,NaT,Total,NaN,NaN,2710193.0,"5,519,888.40","53,360,791.40","672,984.00","52,830,224.40"

In [157]:
pd.to_numeric(sales_data['Qty'])

0              2.0
1              6.0
2            500.0
3              6.0
4              5.0
           ...
19169        320.0
19170        800.0
19171        400.0
19174      99284.9
19175    2710193.0
Name: Qty, Length: 150589, dtype: float64

In [160]:
sales_data['Qty']=pd.to_numeric(sales_data['Qty'])

In [161]:
sales_data['Rate']= pd.to_numeric(sales_data['Rate'].astype(str).str.replace(",","",regex=False),errors='ignore')

In [162]:
sales_data['Rate']=pd.to_numeric(sales_data['Rate'])

### Drop if Rate contains nan value

In [163]:
sales_data.dropna(subset=['Rate'],inplace=True)

In [168]:
sales_data

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,2017-04-01,1,SOLANKI PLASTICS,DONA-VAI-9100,2.0,1690.00,NaN,NaN,NaN
1,2017-04-01,1,SOLANKI PLASTICS,LITE FOAM(1200),6.0,1620.00,NaN,NaN,NaN
2,2017-04-01,2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500.0,23.00,NaN,NaN,NaN
3,2017-04-01,2,SARNESWARA TRADERS,LITE FOAM(1200),6.0,1620.00,NaN,NaN,NaN
4,2017-04-01,2,SARNESWARA TRADERS,DONA-VAI-9100,5.0,1690.00,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19169,2019-10-10,Sal:4935,K.SRIHARI,13*16 Bk(100)KRISHN,320.0,16.00,"5,120.00",NaN,NaN
19170,2019-10-10,Sal:4935,K.SRIHARI,10*12 RK,800.0,8.50,"6,800.00",NaN,NaN
19171,2019-10-10,Sal:4935,K.SRIHARI,13*16 WHITE RK,400.0,16.00,"6,400.00",NaN,NaN
19174,NaT,Total,NaN,NaN,99284.9,175381.65,"2,203,649.50","20,680.00","2,189,014.50"
19175,NaT,Total,NaN,NaN,2710193.0,5519888.40,"53,360,791.40","672,984.00","52,830,224.40"

In [175]:
sales_data.isna().sum()

Date               58067
Voucher                0
Party                 21
Product               21
Qty                    0
Rate                   0
Gross              95561
Disc              149556
Voucher Amount    136083
dtype: int64

### To calculate and update gross value based on quantity and rate

In [181]:
sales_data["Gross"]=sales_data['Gross'].fillna(sales_data['Qty']*sales_data['Rate'])

In [182]:
sales_data

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,2017-04-01,1,SOLANKI PLASTICS,DONA-VAI-9100,2.0,1690.00,3380,NaN,NaN
1,2017-04-01,1,SOLANKI PLASTICS,LITE FOAM(1200),6.0,1620.00,9720,NaN,NaN
2,2017-04-01,2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500.0,23.00,11500,NaN,NaN
3,2017-04-01,2,SARNESWARA TRADERS,LITE FOAM(1200),6.0,1620.00,9720,NaN,NaN
4,2017-04-01,2,SARNESWARA TRADERS,DONA-VAI-9100,5.0,1690.00,8450,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19169,2019-10-10,Sal:4935,K.SRIHARI,13*16 Bk(100)KRISHN,320.0,16.00,"5,120.00",NaN,NaN
19170,2019-10-10,Sal:4935,K.SRIHARI,10*12 RK,800.0,8.50,"6,800.00",NaN,NaN
19171,2019-10-10,Sal:4935,K.SRIHARI,13*16 WHITE RK,400.0,16.00,"6,400.00",NaN,NaN
19174,NaT,Total,NaN,NaN,99284.9,175381.65,"2,203,649.50","20,680.00","2,189,014.50"
19175,NaT,Total,NaN,NaN,2710193.0,5519888.40,"53,360,791.40","672,984.00","52,830,224.40"

In [183]:
sales_data.describe()

                Qty          Rate
count  1.505890e+05  1.505890e+05
mean   3.109896e+02  4.680651e+02
std    2.050522e+04  3.103868e+04
min    0.000000e+00  0.000000e+00
25%    1.000000e+01  1.600000e+01
50%    5.000000e+01  2.850000e+01
75%    1.400000e+02  1.400000e+02
max    7.097803e+06  1.002420e+07

In [184]:
sales_data.isna().sum()

Date               58067
Voucher                0
Party                 21
Product               21
Qty                    0
Rate                   0
Gross                  0
Disc              149556
Voucher Amount    136083
dtype: int64

In [196]:
sales_data=sales_data.dropna(subset=["Product"])

In [197]:
sales_data.isna().sum()

Date               58046
Voucher                0
Party                  0
Product                0
Qty                    0
Rate                   0
Gross                  0
Disc              149556
Voucher Amount    136083
dtype: int64

In [198]:
sales_data.describe()

                 Qty           Rate
count  150568.000000  150568.000000
mean      180.753052     261.657776
std       738.803789    2153.787611
min         0.000000       0.000000
25%        10.000000      16.000000
50%        50.000000      28.500000
75%       140.000000     140.000000
max     35000.000000  200000.000000

## 2. Merge functions example

In [204]:
customers = pd.DataFrame({
    "customer_id": [101, 102, 103, 104],
    "customer_name": ["Sathiya", "Selva", "Ashok", "Inba"],
    "city": ["Chennai", "Madurai", "Coimbatore", "Madurai"]
})

orders = pd.DataFrame({
    "order_id": [1001, 1002, 1003, 1004, 1005],
    "customer_id": [101, 102, 102, 105, 103],
    "order_amount": [500.0, 750.0, 300.0, 900.0, 1200.0]
})

In [206]:
pd.merge(left=customers,right=orders)

   customer_id customer_name        city  order_id  order_amount
0          101       Sathiya     Chennai      1001         500.0
1          102         Selva     Madurai      1002         750.0
2          102         Selva     Madurai      1003         300.0
3          103         Ashok  Coimbatore      1005        1200.0

In [212]:
pd.merge(left=customers,right=orders,on='customer_id',how='inner')

   customer_id customer_name        city  order_id  order_amount
0          101       Sathiya     Chennai      1001         500.0
1          102         Selva     Madurai      1002         750.0
2          102         Selva     Madurai      1003         300.0
3          103         Ashok  Coimbatore      1005        1200.0

In [219]:
pd.merge(left=customers,right=orders,on='customer_id', how='outer',indicator=True)

   customer_id customer_name        city  order_id  order_amount      _merge
0          101       Sathiya     Chennai    1001.0         500.0        both
1          102         Selva     Madurai    1002.0         750.0        both
2          102         Selva     Madurai    1003.0         300.0        both
3          103         Ashok  Coimbatore    1005.0        1200.0        both
4          104          Inba     Madurai       NaN           NaN   left_only
5          105           NaN         NaN    1004.0         900.0  right_only

In [218]:
pd.merge(left=customers,right=orders,on='customer_id',how='left',indicator=True)

   customer_id customer_name        city  order_id  order_amount     _merge
0          101       Sathiya     Chennai    1001.0         500.0       both
1          102         Selva     Madurai    1002.0         750.0       both
2          102         Selva     Madurai    1003.0         300.0       both
3          103         Ashok  Coimbatore    1005.0        1200.0       both
4          104          Inba     Madurai       NaN           NaN  left_only

In [217]:
pd.merge(left=customers,right=orders,on='customer_id',how='right',indicator=True)

   customer_id customer_name        city  order_id  order_amount      _merge
0          101       Sathiya     Chennai      1001         500.0        both
1          102         Selva     Madurai      1002         750.0        both
2          102         Selva     Madurai      1003         300.0        both
3          105           NaN         NaN      1004         900.0  right_only
4          103         Ashok  Coimbatore      1005        1200.0        both

In [220]:
sales_data

,Date,Voucher,Party,Product,Qty,Rate,Gross,Disc,Voucher Amount
0,2017-04-01,1,SOLANKI PLASTICS,DONA-VAI-9100,2.0,1690.0,3380,NaN,NaN
1,2017-04-01,1,SOLANKI PLASTICS,LITE FOAM(1200),6.0,1620.0,9720,NaN,NaN
2,2017-04-01,2,SARNESWARA TRADERS,VISHNU CHOTA WINE,500.0,23.0,11500,NaN,NaN
3,2017-04-01,2,SARNESWARA TRADERS,LITE FOAM(1200),6.0,1620.0,9720,NaN,NaN
4,2017-04-01,2,SARNESWARA TRADERS,DONA-VAI-9100,5.0,1690.0,8450,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19167,2019-10-10,Sal:4935,K.SRIHARI,16*20(100-W),140.0,26.0,"3,640.00",NaN,NaN
19168,2019-10-10,Sal:4935,K.SRIHARI,10*12 KRISHNA-BK(10,600.0,8.4,"5,040.00",NaN,NaN
19169,2019-10-10,Sal:4935,K.SRIHARI,13*16 Bk(100)KRISHN,320.0,16.0,"5,120.00",NaN,NaN
19170,2019-10-10,Sal:4935,K.SRIHARI,10*12 RK,800.0,8.5,"6,800.00",NaN,NaN
19171,2019-10-10,Sal:4935,K.SRIHARI,13*16 WHITE RK,400.0,16.0,"6,400.00",NaN,NaN

##  3. List comprehension 2 example

In [226]:
sales_data.dtypes

Date              datetime64[ns]
Voucher                   object
Party                     object
Product                   object
Qty                      float64
Rate                     float64
Gross                     object
Disc                      object
Voucher Amount            object
dtype: object

In [225]:
sales_data['Gross']=pd.to_numeric(sales_data['Gross'].astype(str).str.replace(",","",regex=False),errors='ignore')

In [227]:
sales_data['Gross']=pd.to_numeric(sales_data['Gross'])

ValueError: Unable to parse string " " at position 133657

In [228]:
sales_data[sales_data['Gross']==" "]

  Date Voucher Party Product  Qty  Rate Gross Disc Voucher Amount
3  NaT          28/3          0.0   0.0
5  NaT          25/2          0.0   0.0